hathach/nxp_driver/sdk/devices/MCXN947/drivers/fsl_trdc.h
/*
 * Copyright 2022,2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_TRDC_H_
#define FSL_TRDC_H_

#include "fsl_common.h"
#include "fsl_trdc_core.h"

/*!
 * @addtogroup trdc
 * @{
 */

/******************************************************************************
 * Definitions
 *****************************************************************************/
#define FSL_TRDC_DRIVER_VERSION (MAKE_VERSION(2, 2, 0))

#if defined(FSL_FEATURE_TRDC_HAS_GENERAL_CONFIG) && FSL_FEATURE_TRDC_HAS_GENERAL_CONFIG
/* Hardware configuration definitions */
/*!
 * @brief TRDC hardware configuration.
 */
typedef struct _trdc_hardware_config
{
    uint8_t masterNumber; /*!< Number of bus masters. */
    uint8_t domainNumber; /*!< Number of domains.     */
    uint8_t mbcNumber;    /*!< Number of MBCs.        */
    uint8_t mrcNumber;    /*!< Number of MRCs.        */
} trdc_hardware_config_t;
#endif

#if defined(FSL_FEATURE_TRDC_HAS_MBC) && FSL_FEATURE_TRDC_HAS_MBC
/*!
 * @brief Hardware configuration of the two slave memories within each MBC(memory block checker).
 */
typedef struct _trdc_slave_memory_hardware_config
{
    uint32_t blockNum;  /*!< Number of blocks. */
    uint32_t blockSize; /*!< Block size. */
} trdc_slave_memory_hardware_config_t;
#endif

#if defined(FSL_FEATURE_TRDC_HAS_DOMAIN_ASSIGNMENT) && FSL_FEATURE_TRDC_HAS_DOMAIN_ASSIGNMENT
/* Master domain assignment definitions */
/*!
 * @brief TRDC domain ID select method, the register bit TRDC_MDA_W0_0_DFMT0[DIDS], used for
 * domain hit evaluation.
 */
typedef enum _trdc_did_sel
{
    kTRDC_DidMda,         /*!< Use MDAn[2:0] as DID. */
    kTRDC_DidInput,       /*!< Use the input DID (DID_in) as DID. */
    kTRDC_DidMdaAndInput, /*!< Use MDAn[2] concatenated with DID_in[1:0] as DID. */
    kTRDC_DidReserved     /*!< Reserved. */
} trdc_did_sel_t;

/*!
 * @brief TRDC secure attribute, the register bit TRDC_MDA_W0_0_DFMT0[SA], used for
 * bus master domain assignment.
 */
typedef enum _trdc_secure_attr
{
    kTRDC_ForceSecure,    /*!< Force the bus attribute for this master to secure.        */
    kTRDC_ForceNonSecure, /*!< Force the bus attribute for this master to non-secure.    */
    kTRDC_MasterSecure,   /*!< Use the bus master's secure/nonsecure attribute directly. */
    kTRDC_MasterSecure1,  /*!< Use the bus master's secure/nonsecure attribute directly. */
} trdc_secure_attr_t;

/*!
 * @brief The configuration of domain hit evaluation of PID.
 */
typedef enum _trdc_pid_domain_hit_config
{
    kTRDC_pidDomainHitNone0,     /*!< No PID is included in the domain hit evaluation. */
    kTRDC_pidDomainHitNone1,     /*!< No PID is included in the domain hit evaluation. */
    kTRDC_pidDomainHitInclusive, /*!< The PID is included in the domain hit evaluation when (PID & ~PIDM). */
    kTRDC_pidDomainHitExclusive, /*!< The PID is included in the domain hit evaluation when ~(PID & ~PIDM). */
} trdc_pid_domain_hit_config_t;

/*!
 * @brief Domain assignment for the processor bus master.
 */
typedef struct _trdc_processor_domain_assignment
{
    uint32_t domainId : 4U;           /*!< Domain ID. */
    uint32_t domainIdSelect : 2U;     /*!< Domain ID select method, see @ref trdc_did_sel_t. */
    uint32_t pidDomainHitConfig : 2U; /*!< The configuration of the domain hit evaluation for PID, see @ref
                                         trdc_pid_domain_hit_config_t. */
    uint32_t pidMask : 6U;    /*!< The mask combined with PID, so multiple PID can be included as part of the domain hit
                                 determination. Set to 0 to disable. */
    uint32_t secureAttr : 2U; /*!< Secure attribute, see @ref trdc_secure_attr_t. */
    uint32_t pid : 6U;  /*!< The process identifier, combined with pidMask to form the domain hit determination. */
    uint32_t : 8U;      /*!< Reserved. */
    uint32_t lock : 1U; /*!< Lock the register. */
    uint32_t : 1U;      /*!< Reserved. */
} trdc_processor_domain_assignment_t;

/*!
 * @brief TRDC privileged attribute, the register bit TRDC_MDA_W0_x_DFMT1[PA], used for non-processor
 * bus master domain assignment.
 */
typedef enum _trdc_privilege_attr
{
    kTRDC_ForceUser,        /*!< Force the bus attribute for this master to user. */
    kTRDC_ForcePrivilege,   /*!< Force the bus attribute for this master to privileged. */
    kTRDC_MasterPrivilege,  /*!< Use the bus master's attribute directly. */
    kTRDC_MasterPrivilege1, /*!< Use the bus master's attribute directly. */
} trdc_privilege_attr_t;

/*!
 * @brief Domain assignment for the non-processor bus master.
 */
typedef struct _trdc_non_processor_domain_assignment
{
    uint32_t domainId : 4U;       /*!< Domain ID. */
    uint32_t privilegeAttr : 2U;  /*!< Privileged attribute, see @ref trdc_privilege_attr_t. */
    uint32_t secureAttr : 2U;     /*!< Secure attribute, see @ref trdc_secure_attr_t. */
    uint32_t bypassDomainId : 1U; /*!< Bypass domain ID. */
    uint32_t : 21U;               /*!< Reserved. */
    uint32_t lock : 1U;           /*!< Lock the register. */
    uint32_t : 1U;                /*!< Reserved. */
} trdc_non_processor_domain_assignment_t;

/*!
 * @brief PID lock configuration.
 */
typedef enum _trdc_pid_lock
{
    kTRDC_PidUnlocked0, /*!< The PID value can be updated by any secure priviledged write. */
    kTRDC_PidUnlocked1, /*!< The PID value can be updated by any secure priviledged write. */
    kTRDC_PidUnlocked2, /*!< The PID value can be updated by any secure priviledged write from the bus master that first
                           configured this register. */
    kTRDC_PidLocked,    /*!< The PID value is locked until next reset. */
} trdc_pid_lock_t;

/*!
 * @brief Process identifier(PID) configuration for processor cores.
 */
typedef struct _trdc_pid_config
{
    uint32_t pid : 6U;  /*!< The process identifier of the executing task. The highest bit can be used to define
                           secure/nonsecure attribute of the task. */
    uint32_t : 23U;     /*!< Reserved. */
    uint32_t lock : 2U; /*!< How to lock the register, see @ref trdc_pid_lock_t. */
    uint32_t : 1U;      /*!< Reserved. */
} trdc_pid_config_t;
#endif

#if defined(FSL_FEATURE_TRDC_HAS_GENERAL_CONFIG) && FSL_FEATURE_TRDC_HAS_GENERAL_CONFIG
/* TZ-M congiguration definitions */
/*!
 * @brief IDAU(Implementation-Defined Attribution Unit) configuration for TZ-M function control.
 */
typedef struct _trdc_idau_config
{
    uint32_t : 8U;                   /*!< Reserved. */
    uint32_t lockSecureVTOR : 1U;    /*!< Disable writes to secure VTOR(Vector Table Offset Register). */
    uint32_t lockNonsecureVTOR : 1U; /*!< Disable writes to non-secure VTOR, Application interrupt and Reset Control
                                        Registers. */
    uint32_t lockSecureMPU : 1U; /*!< Disable writes to secure MPU(Memory Protection Unit) from software or from a debug
                                    agent connected to the processor in Secure state. */
    uint32_t lockNonsecureMPU : 1U; /*!< Disable writes to non-secure MPU(Memory Protection Unit) from software or from
                                       a debug agent connected to the processor. */
    uint32_t lockSAU : 1U;          /*!< Disable writes to SAU(Security Attribution Unit) registers. */
    uint32_t : 19U;                 /*!< Reserved. */
} trdc_idau_config_t;

/* FLW(Flash Logical Window) configuration definitions */
/*!
 * @brief FLW(Flash Logical Window) configuration.
 */
typedef struct _trdc_flw_config
{
    uint16_t blockCount;    /*!< Block count of the Flash Logic Window in 32KByte blocks. */
    uint32_t arrayBaseAddr; /*!< Flash array base address of the Flash Logical Window. */
    bool lock;              /*!< Disable writes to FLW registers. */
    bool enable;            /*!< Enable FLW function. */
} trdc_flw_config_t;
#endif

#if defined(FSL_FEATURE_TRDC_HAS_DOMAIN_ERROR) && FSL_FEATURE_TRDC_HAS_DOMAIN_ERROR
/* Domain error check and clear definitions */
/*!
 * @brief TRDC controller definition for domain error check. Each TRDC instance may have different
 * MRC or MBC count, call TRDC_GetHardwareConfig to get the actual count.
 */
typedef enum _trdc_controller
{
    kTRDC_MemBlockController0 = 0U,  /*!< Memory block checker 0. */
    kTRDC_MemBlockController1 = 1U,  /*!< Memory block checker 1. */
    kTRDC_MemBlockController2 = 2U,  /*!< Memory block checker 2. */
    kTRDC_MemBlockController3 = 3U,  /*!< Memory block checker 3. */
    kTRDC_MemRegionChecker0   = 4U,  /*!< Memory region checker 0.   */
    kTRDC_MemRegionChecker1   = 5U,  /*!< Memory region checker 1.   */
    kTRDC_MemRegionChecker2   = 6U,  /*!< Memory region checker 2.   */
    kTRDC_MemRegionChecker3   = 7U,  /*!< Memory region checker 3.   */
    kTRDC_MemRegionChecker4   = 8U,  /*!< Memory region checker 4.   */
    kTRDC_MemRegionChecker5   = 9U,  /*!< Memory region checker 5.   */
    kTRDC_MemRegionChecker6   = 10U, /*!< Memory region checker 6.   */
} trdc_controller_t;

/*!
 * @brief TRDC domain error state definition TRDC_MBCn_DERR_W1[EST] or TRDC_MRCn_DERR_W1[EST].
 */
typedef enum _trdc_error_state
{
    kTRDC_ErrorStateNone   = 0x00U, /*!< No access violation detected.       */
    kTRDC_ErrorStateNone1  = 0x01U, /*!< No access violation detected.       */
    kTRDC_ErrorStateSingle = 0x02U, /*!< Single access violation detected.   */
    kTRDC_ErrorStateMulti  = 0x03U  /*!< Multiple access violation detected. */
} trdc_error_state_t;

/*!
 * @brief TRDC domain error attribute definition TRDC_MBCn_DERR_W1[EATR] or TRDC_MRCn_DERR_W1[EATR].
 */
typedef enum _trdc_error_attr
{
    kTRDC_ErrorSecureUserInst         = 0x00U, /*!< Secure user mode, instruction fetch access.           */
    kTRDC_ErrorSecureUserData         = 0x01U, /*!< Secure user mode, data access.                        */
    kTRDC_ErrorSecurePrivilegeInst    = 0x02U, /*!< Secure privileged mode, instruction fetch access.     */
    kTRDC_ErrorSecurePrivilegeData    = 0x03U, /*!< Secure privileged mode, data access.                  */
    kTRDC_ErrorNonSecureUserInst      = 0x04U, /*!< NonSecure user mode, instruction fetch access.        */
    kTRDC_ErrorNonSecureUserData      = 0x05U, /*!< NonSecure user mode, data access.                     */
    kTRDC_ErrorNonSecurePrivilegeInst = 0x06U, /*!< NonSecure privileged mode, instruction fetch access.  */
    kTRDC_ErrorNonSecurePrivilegeData = 0x07U  /*!< NonSecure privileged mode, data access.               */
} trdc_error_attr_t;

/*!
 * @brief TRDC domain error access type definition TRDC_DERR_W1_n[ERW].
 */
typedef enum _trdc_error_type
{
    kTRDC_ErrorTypeRead  = 0x00U, /*!< Error occurs on read reference.  */
    kTRDC_ErrorTypeWrite = 0x01U  /*!< Error occurs on write reference. */
} trdc_error_type_t;

/*!
 * @brief TRDC domain error definition.
 */
typedef struct _trdc_domain_error
{
    trdc_controller_t controller;  /*!< Which controller captured access violation.     */
    uint32_t address;              /*!< Access address that generated access violation. */
    trdc_error_state_t errorState; /*!< Error state.                                    */
    trdc_error_attr_t errorAttr;   /*!< Error attribute.                                */
    trdc_error_type_t errorType;   /*!< Error type.                                     */
    uint8_t errorPort;             /*!< Error port.                                     */
    uint8_t domainId;              /*!< Domain ID.                                      */
    uint8_t slaveMemoryIdx;        /*!< The slave memory index. Only apply when violation in MBC. */
} trdc_domain_error_t;
#endif

